// using Microsoft.EntityFrameworkCore;
// using Microsoft.Extensions.DependencyInjection;
// using mohaymen_codestar_Team02.Data;
// using mohaymen_codestar_Team02.Dto;
// using mohaymen_codestar_Team02.Models;
// using mohaymen_codestar_Team02.Models.EdgeEAV;
// using mohaymen_codestar_Team02.Models.VertexEAV;
// using mohaymen_codestar_Team02.Services.DataAdminService;
//
// namespace mohaymen_codestar_Team02_XUnitTest.Servies.AnalystService;
//
// public class AnalystServiceTest
// {
//     private readonly mohaymen_codestar_Team02.Services.AnalystService.AnalystService _sut;
//     private readonly IServiceProvider _serviceProvider;
//     private readonly IDataAdminService _dataAdminService;
//
//     public AnalystServiceTest()
//     {
//         var serviceCollection = new ServiceCollection();
//
//         var options = new DbContextOptionsBuilder<DataContext>()
//             .UseInMemoryDatabase(Guid.NewGuid().ToString())
//             .Options;
//
//         serviceCollection.AddScoped(_ => new DataContext(options));
//         _serviceProvider = serviceCollection.BuildServiceProvider();
//         _dataAdminService = _serviceProvider.GetRequiredService<IDataAdminService>();
//         _sut = new mohaymen_codestar_Team02.Services.AnalystService.AnalystService(_serviceProvider);
//     }
//
//     [Fact]
//     public async Task GetTheVertexNeighbor_ShouldReturnValidResponse_WhenValidData()
//     {
//         var response = await _dataAdminService.StoreData(
//             "\"SourceAcount\",\"DestiantionAccount\",\"Amount\",\"Date\",\"TransactionID\",\"Type\"\n\"6534454617\",\"6039548046\",\"500,000,000\",\"1399/04/23\",\"153348811341\",\"پایا\"\n\"6039548046\",\"5287517379\",\"100,000,000\",\"1399/04/23\",\"192524206627\",\"پایا\"\n\"6039548046\",\"5718373092\",\"200,000,000\",\"1399/04/27\",\"113480622054\",\"پایا\"\n\"6039548046\",\"9862369812\",\"300,000,000\",\"1399/04/28\",\"114556773378\",\"پایا\"\n\"5287517379\",\"1205418051\",\"50,000,000\",\"1399/04/29\",\"185136982986\",\"کارت به کارت\"\n\"9862369812\",\"3714493428\",\"350,000,000\",\"1399/04/30\",\"197303042408\",\"پایا\"\n\"5718373092\",\"3714493428\",\"2,000,000,000\",\"1399/04/31\",\"173993949660\",\"ساتنا\"\n\"1205418051\",\"7434776097\",\"800,000,000\",\"1399/04/31\",\"107213392290\",\"پایا\"\n\"3714493428\",\"7434776097\",\"1,000,000,000\",\"1399/04/31\",\"131554897007\",\"ساتنا\"\n\"4727992815\",\"7434776097\",\"2,000,000,000\",\"1399/05/01\",\"163090175418\",\"ساتنا\"\n\"7434776097\",\"3084026274\",\"4,000,000,000\",\"1399/05/02\",\"126328028392\",\"ساتنا\"\n\"4727992815\",\"3084026274\",\"200,000,000\",\"1399/05/03\",\"133232291681\",\"پایا\"\n",
//             "\"AccountID\",\"CardID\",\"IBAN\",\"AccountType\",\"BranchTelephone\",\"BranchAdress\",\"BranchName\",\"OwnerName\",\"OwnerLastName\",\"OwnerID\"\n\"6534454617\",\"6104335000000190\",\"IR120778801496000000198\",\"پس انداز\",\"55638667\",\"تهران-خیابان خیام-بالاتر از چهارراه گلوبندک\",\"گلوبندک\",\"افسر\",\"طباطبایی\",\"1227114110\"\n\"4000000028\",\"6037699000000020\",\"IR033880987114000000028\",\"سپرده\",\"77547230\",\"تهران-خيابان شهيد مدنی-نبش خيابان اميرشرفی\",\"امیر شرفی\",\"ایرج\",\"مددی\",\"3658507956\"\n\"3000000406\",\"6221060000000400\",\"IR248204855973000000406\",\"سپرده\",\"22760489\",\"تهران-خيابان دولت-خيابان ديباجی جنوبی-نبش خيابان شهيد عرفاتی-شماره 82\",\"ديباجی جنوبی\",\"ترانه\",\"برزگری\",\"0233079137\"\n\"4000000290\",\"6219867000000290\",\"IR806364680364000000290\",\"جاری\",\"22960013\",\"تهران-چهارراه پاسداران-میدان حسین\u200cآباد-ساختمان مهدی-پلاک 120\",\"میدان حسین آباد\",\"ترمه\",\"نصیری\",\"3472758002\"\n\"6039548046\",\"6104333000000360\",\"IR437427012782000000361\",\"پس انداز\",\"33502628\",\"تهران-خیابان ری-نرسیده به سه\u200c راه امین حضور-جنب کوچه آبشار\",\"آبشار\",\"ارژنگ\",\"مرتضوی\",\"8260281348\"\n\"9000000331\",\"6221062000000330\",\"IR382666702669000000331\",\"پس انداز\",\"22237244\",\"تهران-خيابان شريعتی-خيابان موسی وند-خيابان کريمی-شماره 151\",\"خيابان بوعلی\",\"تینا\",\"اشتیانی\",\"9650799964\"\n\"2000000307\",\"5028064000000300\",\"IR515705817182000000307\",\"سپرده\",\"77728343\",\"تهران-تهرانپارس-خیابان رشید-نبش کوچه 148 غربی-پلاک 119\",\"تهرانپارس - رشید\",\"ارین\",\"نجفی\",\"2383698300\"\n\"3000000352\",\"6104335000000350\",\"IR447139041943000000352\",\"جاری\",\"55898061\",\"تهران-خیابان 15 خرداد-بازار عباس آباد-سرای آزادی-طبقه دوم\",\"سرای آزادی\",\"حمید\",\"یثربی\",\"1782886202\"\n\"8000000459\",\"6395999000000450\",\"IR999469685408000000459\",\"جاری\",\"77227190\",\"تهران-خیابان فرجام شرقی-بین سراج و چهارراه ولیعصر-جنب گزینش ناجا-پلاک 1/514\",\"فرجام شرقی\",\"خسرو\",\"صفوی\",\"5674868748\"\n\"8000000402\",\"6393468000000400\",\"IR666786156808000000402\",\"جاری\",\"66571376\",\"تهران-خیابان امیر آباد شمالی-روبروی پمپ بنزین-نبش کوچه اشراقی\",\"امیر آباد شمالی\",\"دارا\",\"زمان زاده\",\"6935043332\"\n\"5287517379\",\"6219867000000430\",\"IR768572504519000000439\",\"سپرده\",\"55481172\",\"تهران-خيابان کارگرجنوبی-ضلع شمال شرقی ميدان قزوين-پلاک 18\",\"میدان قزوین\",\"دریا\",\"حسین زاده\",\"9823618218\"\n\"9862369812\",\"6104336000000280\",\"IR555340066618000000280\",\"جاری\",\"88556268\",\"تهران-خیابان شهید مطهری-نرسیده به خیابان قائم مقام فراهانی-پلاک 257\",\"استاد مطهری\",\"کامران\",\"رضایی\",\"2684955349\"\n\"5718373092\",\"6221065000000320\",\"IR254972538744000000320\",\"پس انداز\",\"66362188\",\"تهران-خيابان آزادی-نبش خيابان آذربايجان-شماره 332\",\"آزادی\",\"کیانوش\",\"قاضی\",\"1181323213\"\n\"1205418051\",\"6104332000000060\",\"IR782956669947000000060\",\"سپرده\",\"33769073\",\"تهران-شهرری-شهرک دولت آباد-فلکه اول\",\"دولت آباد\",\"ژیلا\",\"زمان زاده\",\"4398373386\"\n\"1000000236\",\"6037697000000230\",\"IR311031297571000000236\",\"جاری\",\"55707330\",\"تهران-خیابان قزوین-نرسیده به دو راهی قپان-پلاک 843\",\"امین الملک\",\"ساناز\",\"حسن پور\",\"8655501965\"\n\"3714493428\",\"6280233000000450\",\"IR590757191926000000453\",\"سپرده\",\"55746611\",\"تهران-خیابان قزوین-دوراهی\u200cقپان-خیابان فرهنگ-پلاک 945\",\"اذری\",\"ستایش\",\"سالاری\",\"8083189094\"\n\"7000000069\",\"5041728000000060\",\"IR537707653587000000069\",\"پس انداز\",\"33136732\",\"تهران-خیابان 17 شهریور-پایین تر از پل آهنگ-پلاک 954\",\"17شهریور\",\"نقی\",\"طباطبایی\",\"7518497901\"\n\"4727992815\",\"5028064000000040\",\"IR129871182765000000045\",\"جاری\",\"55601544\",\"تهران-خیابان مولوی غربی-بعد از میدان محمدیه-پلاک 744\",\"مولوی غربی\",\"نگار\",\"احمدی\",\"1247145263\"\n\"9000000487\",\"5028066000000480\",\"IR541008141089000000487\",\"سپرده\",\"66067052\",\"تهران-خیابان آزادی-ما بین خیابان شهیدان و خیابان جیحون-ابتدای کوچه مشعوف-پلاک 378\",\"آزادی - یادگار\",\"مهتاب\",\"قاضی\",\"0466444575\"\n\"7434776097\",\"6219869000000180\",\"IR955348247339000000184\",\"سپرده\",\"22234427\",\"تهران-بلوار 35 متری قیطریه-روبروی پارک قیطریه-پلاک 85\",\"قیطریه\",\"بامداد\",\"برزگری\",\"7333935716\"\n\"7000000021\",\"6037999000000020\",\"IR357530402617000000021\",\"جاری\",\"55000069\",\"تهران-خانی آباد نو-خیابان شهرداری-نبش خیابان مینا\",\"خانی آباد نو\",\"بهناز\",\"اشتیانی\",\"3184365126\"\n\"3084026274\",\"6104333000000000\",\"IR378370321425000000008\",\"پس انداز\",\"66057406\",\"تهران-خیابان آزادی-مقابل دانشگاه صنعتی شریف-نبش کوچه حیدرتاش-پلاک 240\",\"آزادی\",\"انوش\",\"ابراهیمی\",\"2746339440\"\n\"4000000400\",\"5028063000000400\",\"IR508577914084000000400\",\"جاری\",\"88717727\",\"تهران-خیابان احمد قصیر-بین خیابان پنجم و خیابان هفتم-پلاک 16\",\"احمد قصیر\",\"پرهام\",\"عسگرپور\",\"5125488187\"\n\"1000000358\",\"5028067000000350\",\"IR463499058601000000358\",\"سپرده\",\"56696077\",\"تهران-اسلامشهر-ابتدای بیست متری امام خمینی (ره)-جنب مسجد امام نقی(ع)\",\"اسلامشهر\",\"پیروز\",\"شکاری\",\"9710095137\"\n\"8000000190\",\"6221064000000190\",\"IR401698532368000000190\",\"جاری\",\"46889990\",\"تهران-بلوار انقلاب-نبش خيابان کشاورز\",\"شهر قدس\",\"مانی\",\"عبدلی\",\"8320298705\"\n\"9000000405\",\"6395995000000400\",\"IR500379357299000000405\",\"پس انداز\",\"22844370\",\"تهران-خیابان خواجه عبدالله انصاری-نبش کوچه ششم-پلاک 110\",\"خواجه عبدالله انصاری\",\"شیرین\",\"ابراهیم نژاد\",\"4031019294\"\n",
//             "test",
//             "transaction", "account");
//         using var scope = _serviceProvider.CreateScope();
//         var dataContext = scope.ServiceProvider.GetRequiredService<DataContext>();
//         Console.WriteLine(dataContext.DataSets);
//     }
// }

